
# 绘制
import cv2
import numpy as np

# 创建画布，长宽为300*300，3种颜色，灰度的数值类型是无符号八位整数
image = np.zeros([600, 300, 3], dtype=np.uint8)

# 画一条直线，起点坐标，终点坐标，颜色，宽度像素
cv2.line(image, (100, 200), (250, 250), (255, 0, 0), 2)

# 画矩形框，起点坐标，终点坐标，颜色，宽度像素
cv2.rectangle(image, (30, 100), (60, 150), (0, 255, 0), 2)

# 画圆环，圆心坐标，半径，颜色，宽度像素
cv2.circle(image, (150, 100), 20, (0, 0, 255), 3)

# 绘制字符串，坐标，字体序号（默认字体），缩放系数，颜色，粗心，线条类型1-实线
cv2.putText(image, "hello", (100, 50), 0, 1, (255, 255, 255), 2, 1)

cv2.imshow("image", image)
cv2.waitKey()
